In [1]:
import pandas as pd
import numpy as np
%pip install mysql-connector-python
import mysql.connector as conn

Requirement already satisfied: mysql-connector-python in c:\users\alexi\anaconda3\lib\site-packages (8.0.32)
Requirement already satisfied: protobuf<=3.20.3,>=3.11.0 in c:\users\alexi\anaconda3\lib\site-packages (from mysql-connector-python) (3.20.3)
Note: you may need to restart the kernel to use updated packages.

In [2]:
actores=pd.read_csv('../data/actor.csv')
categorias=pd.read_csv('../data/category.csv')
peliculas=pd.read_csv('../data/film.csv')
inventario=pd.read_csv('../data/inventory.csv')
lenguaje=pd.read_csv('../data/language.csv')
antiguo=pd.read_csv('../data/old_HDD.csv')
alquileres=pd.read_csv('../data/rental.csv')

In [3]:
actores.head()

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

In [4]:
categorias.head()

   category_id       name          last_update
0            1     Action  2006-02-15 04:46:27
1            2  Animation  2006-02-15 04:46:27
2            3   Children  2006-02-15 04:46:27
3            4   Classics  2006-02-15 04:46:27
4            5     Comedy  2006-02-15 04:46:27

In [5]:
peliculas.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,NaN,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,NaN,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [6]:
inventario.head()

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 05:09:17
1             2        1         1  2006-02-15 05:09:17
2             3        1         1  2006-02-15 05:09:17
3             4        1         1  2006-02-15 05:09:17
4             5        1         2  2006-02-15 05:09:17

In [7]:
lenguaje.head()

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19

In [8]:
antiguo.head()

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

In [9]:
alquileres.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [10]:
def limpiar_dataframe(df):
    #La columna last_update la combio a formato fecha eliminando la hora ya que no me significa nada saber a que hora fue actualizado
    if 'last_update' in df.columns:
        df['last_update'] = pd.to_datetime(df['last_update'], format='%Y-%m-%d')
        
# Rellenar los valores nulos con 'NoInfo'.
    df.fillna('NoInfo', inplace=True)

In [11]:
# Limpio todas los dataframes menos antiguo que no posee la columna last_update
limpiar_dataframe(actores)
limpiar_dataframe(categorias)
limpiar_dataframe(peliculas)
limpiar_dataframe(inventario)
limpiar_dataframe(lenguaje)
limpiar_dataframe(alquileres)

In [12]:
actores.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   actor_id     200 non-null    int64
 1   first_name   200 non-null    object
 2   last_name    200 non-null    object
 3   last_update  200 non-null    datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(2)
memory usage: 6.4+ KB

In [13]:
# pongo las titulos de las columnas de todos mis data frames y la infomacion comenzando por mayusculula
actores.columns = actores.columns.str.title()
categorias.columns = categorias.columns.str.title()
peliculas.columns = peliculas.columns.str.title()
inventario.columns = inventario.columns.str.title()
lenguaje.columns = lenguaje.columns.str.title()
antiguo.columns = antiguo.columns.str.title()
alquileres.columns = alquileres.columns.str.title()

In [14]:
antiguo.head()

  First_Name Last_Name                  Title  Release_Year  Category_Id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

In [15]:
antiguo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   First_Name    1000 non-null   object
 1   Last_Name     1000 non-null   object
 2   Title         1000 non-null   object
 3   Release_Year  1000 non-null   int64
 4   Category_Id   1000 non-null   int64
dtypes: int64(2), object(3)
memory usage: 39.2+ KB

In [16]:
actores.tail()

     Actor_Id First_Name Last_Name         Last_Update
195       196       BELA    WALKEN 2006-02-15 04:34:33
196       197      REESE      WEST 2006-02-15 04:34:33
197       198       MARY    KEITEL 2006-02-15 04:34:33
198       199      JULIA   FAWCETT 2006-02-15 04:34:33
199       200      THORA    TEMPLE 2006-02-15 04:34:33

In [17]:
peliculas["Language_Id"].info()

<class 'pandas.core.series.Series'>
RangeIndex: 1000 entries, 0 to 999
Series name: Language_Id
Non-Null Count  Dtype
--------------  -----
1000 non-null   int64
dtypes: int64(1)
memory usage: 7.9 KB

In [18]:
peliculas["Language_Id"].unique()

array([1], dtype=int64)

In [19]:
peliculas = peliculas.drop(['Original_Language_Id'], axis=1)
#borro la columna original_language_id ya que tiene todos nulos y no me sirve para nada

In [20]:
# Como esta columna tiene como valor unico '1' lo cambio todo por 'EN'
peliculas.loc[:, 'Language_Id'] = 'EN'

In [21]:
actores['Full_Name'] = actores['Last_Name'] + ' ' + actores['First_Name']
antiguo['Full_Name'] = antiguo['Last_Name'] + ' ' + antiguo['First_Name']
# Junto first name y last name de los df actores y antiguo en una nueva columna que se llama full_name. 
# Simplifico en el nexo entre ambos df

In [22]:
# Hago un left join de antiguo con actores
antiguo = antiguo.merge(actores, on = 'Full_Name', how='left')

In [23]:
antiguo.head()
# Debido al merge, me ha creado todas las columnas que tenia actores dentro de antiguo

,First_Name_x,Last_Name_x,Title,Release_Year,Category_Id,Full_Name,Actor_Id,First_Name_y,Last_Name_y,Last_Update
0,PENELOPE,GUINESS,ACADEMY DINOSAUR,2006,6,GUINESS PENELOPE,1,PENELOPE,GUINESS,2006-02-15 04:34:33
1,PENELOPE,GUINESS,ANACONDA CONFESSIONS,2006,2,GUINESS PENELOPE,1,PENELOPE,GUINESS,2006-02-15 04:34:33
2,PENELOPE,GUINESS,ANGELS LIFE,2006,13,GUINESS PENELOPE,1,PENELOPE,GUINESS,2006-02-15 04:34:33
3,PENELOPE,GUINESS,BULWORTH COMMANDMENTS,2006,10,GUINESS PENELOPE,1,PENELOPE,GUINESS,2006-02-15 04:34:33
4,PENELOPE,GUINESS,CHEAPER CLYDE,2006,14,GUINESS PENELOPE,1,PENELOPE,GUINESS,2006-02-15 04:34:33

In [24]:
# Hago un left join de old_hdd con film.
antiguo = antiguo.merge(peliculas, on= 'Title', how='left')

In [25]:
antiguo.head()
# Ahora debido al merge, me ha creado todas las columnas que tenia peliculas dentro de antiguo

,First_Name_x,Last_Name_x,Title,Release_Year_x,Category_Id,Full_Name,Actor_Id,First_Name_y,Last_Name_y,Last_Update_x,...,Description,Release_Year_y,Language_Id,Rental_Duration,Rental_Rate,Length,Replacement_Cost,Rating,Special_Features,Last_Update_y
0,PENELOPE,GUINESS,ACADEMY DINOSAUR,2006,6,GUINESS PENELOPE,1,PENELOPE,GUINESS,2006-02-15 04:34:33,...,A Epic Drama of a Feminist And a Mad Scientist...,2006,EN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,PENELOPE,GUINESS,ANACONDA CONFESSIONS,2006,2,GUINESS PENELOPE,1,PENELOPE,GUINESS,2006-02-15 04:34:33,...,A Lacklusture Display of a Dentist And a Denti...,2006,EN,3,0.99,92,9.99,R,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,PENELOPE,GUINESS,ANGELS LIFE,2006,13,GUINESS PENELOPE,1,PENELOPE,GUINESS,2006-02-15 04:34:33,...,A Thoughtful Display of a Woman And a Astronau...,2006,EN,3,2.99,74,15.99,G,Trailers,2006-02-15 05:03:42
3,PENELOPE,GUINESS,BULWORTH COMMANDMENTS,2006,10,GUINESS PENELOPE,1,PENELOPE,GUINESS,2006-02-15 04:34:33,...,A Amazing Display of a Mad Cow And a Pioneer w...,2006,EN,4,2.99,61,14.99,G,Trailers,2006-02-15 05:03:42
4,PENELOPE,GUINESS,CHEAPER CLYDE,2006,14,GUINESS PENELOPE,1,PENELOPE,GUINESS,2006-02-15 04:34:33,...,A Emotional Character Study of a Pioneer And a...,2006,EN,6,0.99,87,23.99,G,"Trailers,Commentaries,Behind the Scenes",2006-02-15 05:03:42

In [26]:
# Hago un left join de old_hdd con film.
antiguo = antiguo.merge(categorias, on= 'Category_Id', how='left')

In [27]:
antiguo.columns
#Ahora debido al merge, me ha creado todas las columnas que tenia category dentro de antiguo

Index(['First_Name_x', 'Last_Name_x', 'Title', 'Release_Year_x', 'Category_Id',
       'Full_Name', 'Actor_Id', 'First_Name_y', 'Last_Name_y', 'Last_Update_x',
       'Film_Id', 'Description', 'Release_Year_y', 'Language_Id',
       'Rental_Duration', 'Rental_Rate', 'Length', 'Replacement_Cost',
       'Rating', 'Special_Features', 'Last_Update_y', 'Name', 'Last_Update'],
      dtype='object')

In [28]:
# Hago un merge de peliculas con el nuevo antiguo que tiene ahora todas las columnas de peliculas, actores y categorias.
# Esto me va a permitir aÃ±adir categorias y peliculas.

peliculas = peliculas.merge(antiguo, on= 'Film_Id', how='left')

C:\Users\alexi\AppData\Local\Temp\ipykernel_19000\1601713651.py:4: FutureWarning: Passing 'suffixes' which cause duplicate columns {'Last_Update_y'} in the result is deprecated and will raise a MergeError in a future version.
  peliculas = peliculas.merge(antiguo, on= 'Film_Id', how='left')

In [29]:
peliculas.columns
# Esto generÃ³ duplicados en peliculas

Index(['Film_Id', 'Title_x', 'Description_x', 'Release_Year', 'Language_Id_x',
       'Rental_Duration_x', 'Rental_Rate_x', 'Length_x', 'Replacement_Cost_x',
       'Rating_x', 'Special_Features_x', 'Last_Update_x', 'First_Name_x',
       'Last_Name_x', 'Title_y', 'Release_Year_x', 'Category_Id', 'Full_Name',
       'Actor_Id', 'First_Name_y', 'Last_Name_y', 'Last_Update_x',
       'Description_y', 'Release_Year_y', 'Language_Id_y', 'Rental_Duration_y',
       'Rental_Rate_y', 'Length_y', 'Replacement_Cost_y', 'Rating_y',
       'Special_Features_y', 'Last_Update_y', 'Name', 'Last_Update_y'],
      dtype='object')

In [30]:
# Elimino todas las columnas duplicadas
peliculas.drop(columns= ['Title_y','Release_Year_x','Full_Name', 'Actor_Id','First_Name_y',
                    'Last_Name_y', 'Last_Update_x', 'Description_y','Release_Year_y', 'Language_Id_y',
                    'Rental_Duration_y', 'Rental_Rate_y', 'Length_y', 'Replacement_Cost_y','Rating_y', 'Special_Features_y',
                    'Last_Update_y', 'Name','Last_Update_y','First_Name_x', 'Last_Name_x'], inplace=True)

In [31]:
peliculas.columns

Index(['Film_Id', 'Title_x', 'Description_x', 'Release_Year', 'Language_Id_x',
       'Rental_Duration_x', 'Rental_Rate_x', 'Length_x', 'Replacement_Cost_x',
       'Rating_x', 'Special_Features_x', 'Category_Id'],
      dtype='object')

In [32]:
# Simplifico los nombres de columnas en peliculas
peliculas =peliculas.rename(columns = {'Title_x' : 'Title', 'Description_x':'Description',  'Language_Id_x': 'Language', 'Rental_Duration_x':'Rental_Duration',
                             'Rental_Rate_x':'Rental_Rate', 'Length_x':'Length', 'Replacement_Cost_x':'Replacement_Cost', 'Rating_x':'Rating',
                             'Special_Features_x':'Special_Features','Category_Id':'Genero'})

In [33]:
peliculas.columns

Index(['Film_Id', 'Title', 'Description', 'Release_Year', 'Language',
       'Rental_Duration', 'Rental_Rate', 'Length', 'Replacement_Cost',
       'Rating', 'Special_Features', 'Genero'],
      dtype='object')

In [34]:
# En antiguo solo me tengo que quedar con las dos Foreign Key de Actores y Peliculas
# Comprobar que columnas tengo que eliminar para quedarme solo con las dos que necesito.
antiguo.columns

Index(['First_Name_x', 'Last_Name_x', 'Title', 'Release_Year_x', 'Category_Id',
       'Full_Name', 'Actor_Id', 'First_Name_y', 'Last_Name_y', 'Last_Update_x',
       'Film_Id', 'Description', 'Release_Year_y', 'Language_Id',
       'Rental_Duration', 'Rental_Rate', 'Length', 'Replacement_Cost',
       'Rating', 'Special_Features', 'Last_Update_y', 'Name', 'Last_Update'],
      dtype='object')

In [35]:
# Elimino las columnas que no necesito.
antiguo.drop(columns=['First_Name_x', 'Last_Name_x', 'Title', 'Release_Year_x', 'Category_Id',
       'Full_Name', 'First_Name_y', 'Last_Name_y', 'Last_Update_x',
       'Description', 'Release_Year_y', 'Language_Id', 'Rental_Duration', 'Rental_Rate', 'Length',
       'Replacement_Cost', 'Rating', 'Special_Features', 'Last_Update_y',
       'Name', 'Last_Update'] , inplace=True)

In [36]:
# Compruebo nuevo estado de antiguo
antiguo.columns

Index(['Actor_Id', 'Film_Id'], dtype='object')

In [37]:
# Le aÃ±ado todas las columnas de inventory a rental
alquileres = alquileres.merge(inventario, on= 'Inventory_Id', how='left')

In [38]:
# Reviso nuevo estado de alquileres
alquileres.columns

Index(['Rental_Id', 'Rental_Date', 'Inventory_Id', 'Customer_Id',
       'Return_Date', 'Staff_Id', 'Last_Update_x', 'Film_Id', 'Store_Id',
       'Last_Update_y'],
      dtype='object')

In [39]:
# Borro columnas
alquileres.drop(columns = ['Last_Update_y','Customer_Id','Staff_Id','Store_Id'],inplace=True)

In [40]:
# Como ya tengo todos los datos del stock metido en rental, el data frame inventory no me hace falta.

In [41]:
peliculas.info()
# Tengo 386 duplicados todas las columnas de mi df peliculas menos en Genero.

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1386 entries, 0 to 1385
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Film_Id           1386 non-null   int64
 1   Title             1386 non-null   object
 2   Description       1386 non-null   object
 3   Release_Year      1386 non-null   int64
 4   Language          1386 non-null   object
 5   Rental_Duration   1386 non-null   int64
 6   Rental_Rate       1386 non-null   float64
 7   Length            1386 non-null   int64
 8   Replacement_Cost  1386 non-null   float64
 9   Rating            1386 non-null   object
 10  Special_Features  1386 non-null   object
 11  Genero            1000 non-null   float64
dtypes: float64(3), int64(4), object(5)
memory usage: 140.8+ KB

In [42]:
peliculas.duplicated().sum()

386

In [43]:
peliculas.drop_duplicates( inplace=True)

In [44]:
# Compruebo duplicado
print(peliculas.duplicated().sum())
print(actores.duplicated().sum())
print(antiguo.duplicated().sum())
print(alquileres.duplicated().sum())

0
0
0
0

In [45]:
peliculas['Genero'] = peliculas ['Genero'].fillna(0).astype(int)

In [46]:
peliculas.Genero.unique()

array([ 6, 11,  0,  9, 15, 12,  4,  1,  2, 13,  8, 14,  7, 16, 10,  3,  5])

In [47]:
# Hago una funcion para que me cambie los numeros por los valores en texto.

def cambiar_genero(valor):
    if valor == 1:
        return 'Action'
    elif valor == 2:
        return 'Animation'
    elif valor == 3:
        return 'Children'
    elif valor == 4:
        return 'Classics'
    elif valor == 5:
        return 'Comedy'
    elif valor == 6:
        return 'Documentary'
    elif valor == 7:
        return 'Drama'
    elif valor == 8:
        return 'Family'
    elif valor == 9:
        return 'Foreign'
    elif valor == 10:
        return 'Games'
    elif valor == 11:
        return 'Horror'
    elif valor == 12:
        return 'Music'
    elif valor == 13:
        return 'New'
    elif valor == 14:
        return 'Sci-fi'
    elif valor == 15:
        return 'Sports'
    elif valor == 16:
        return 'Travel'
    else:
        return 'No_Info'
    
# Aplico la funcion con .apply()
peliculas['Genero'] = peliculas['Genero'].apply(cambiar_genero)

In [48]:
peliculas.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1000 entries, 0 to 1385
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Film_Id           1000 non-null   int64
 1   Title             1000 non-null   object
 2   Description       1000 non-null   object
 3   Release_Year      1000 non-null   int64
 4   Language          1000 non-null   object
 5   Rental_Duration   1000 non-null   int64
 6   Rental_Rate       1000 non-null   float64
 7   Length            1000 non-null   int64
 8   Replacement_Cost  1000 non-null   float64
 9   Rating            1000 non-null   object
 10  Special_Features  1000 non-null   object
 11  Genero            1000 non-null   object
dtypes: float64(2), int64(4), object(6)
memory usage: 101.6+ KB

In [49]:
antiguo.rename(columns={'Actor_Id': 'actores_Actor_Id', 'Film_Id': 'peliculas_Film_Id'}, inplace=True)

In [50]:
antiguo.columns

Index(['actores_Actor_Id', 'peliculas_Film_Id'], dtype='object')

In [51]:
# Cambio de nombre al data frame.
actores_peliculas = antiguo

In [52]:
# Revision data frame rental.
# Solo estan metidos 212 titulos, de los 1000 segun el listado de alquileres de la tabla Film
print(alquileres.Film_Id.max())
print(alquileres.Film_Id.min())
print(alquileres.Film_Id.count())

220.0
1.0
212

In [53]:
# Deberia tener la informacion de 4581 peliculas fisicas, pero solo tengo 1000 entradas de 212 peliculas.
print(alquileres.Inventory_Id.max())
print(alquileres.Inventory_Id.min())
print(alquileres.Film_Id.count())

4581
2
212

Conclusiones:

Solo se han metido datos de 212 titulos, pero al haber mas de una pelicula se han aÃ±adido hasta tener 1000 registros.
Necesitaremos el resto de titulos para completar la base de datos.
Acciones tomadas con la informacion de la que disponemos:

Eliminar todas las filas que tengan nulos (o no tengan informacion) en la columna Film_Id.
Si no tengo informacion sobre ellas, no las necesito.
Mi nuevo Rental_Id sera el Inventory_Id que ira de 1 a 1000

In [54]:
alquileres.dropna(subset=['Film_Id'], inplace=True)

In [55]:
# Cambio a tipo integer estas dos columnas.
alquileres['Film_Id'] = alquileres['Film_Id'].astype(int)
alquileres['Inventory_Id'] = alquileres['Inventory_Id'].astype(int)

In [56]:
alquileres.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 212 entries, 0 to 993
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Rental_Id      212 non-null    int64
 1   Rental_Date    212 non-null    object
 2   Inventory_Id   212 non-null    int32
 3   Return_Date    212 non-null    object
 4   Last_Update_x  212 non-null    datetime64[ns]
 5   Film_Id        212 non-null    int32
dtypes: datetime64[ns](1), int32(2), int64(1), object(2)
memory usage: 9.9+ KB

In [57]:
alquileres = alquileres.drop('Rental_Id', axis=1)

In [58]:
alquileres['Rental_Id'] = range(1, len(alquileres) + 1)
alquileres.set_index('Rental_Id', inplace=True)

In [59]:
alquileres.columns

Index(['Rental_Date', 'Inventory_Id', 'Return_Date', 'Last_Update_x',
       'Film_Id'],
      dtype='object')

In [60]:
alquileres.rename(columns={'Film_Id': 'peliculas_Film_Id'}, inplace=True)

In [61]:
alquileres.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 212 entries, 1 to 212
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Rental_Date        212 non-null    object
 1   Inventory_Id       212 non-null    int32
 2   Return_Date        212 non-null    object
 3   Last_Update_x      212 non-null    datetime64[ns]
 4   peliculas_Film_Id  212 non-null    int32
dtypes: datetime64[ns](1), int32(2), object(2)
memory usage: 8.3+ KB

In [62]:
actores.to_csv(r'actores.csv', index=True)
peliculas.to_csv(r'peliculas.csv', index=True)
inventario.to_csv(r'inventario.csv', index=True)
actores_peliculas.to_csv(r'actores_peliculas.csv', index=True)
alquileres.to_csv(r'alquileres.csv', index=True)

In [63]:
actores_peliculas.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   actores_Actor_Id   1000 non-null   int64
 1   peliculas_Film_Id  1000 non-null   int64
dtypes: int64(2)
memory usage: 23.4 KB

In [64]:
actores_peliculas.actores_Actor_Id.unique

<bound method Series.unique of 0       1
1       1
2       1
3       1
4       1
       ..
995    39
996    39
997    39
998    39
999    39
Name: actores_Actor_Id, Length: 1000, dtype: int64>

In [65]:
actores.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Actor_Id     200 non-null    int64
 1   First_Name   200 non-null    object
 2   Last_Name    200 non-null    object
 3   Last_Update  200 non-null    datetime64[ns]
 4   Full_Name    200 non-null    object
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 7.9+ KB

In [66]:
actores_peliculas.tail(50)

     actores_Actor_Id  peliculas_Film_Id
950                37                553
951                37                555
952                37                572
953                37                588
954                37                662
955                37                663
956                37                694
957                37                697
958                37                785
959                37                839
960                37                840
961                37                853
962                37                900
963                37                925
964                37                963
965                37                966
966                37                989
967                37                997
968                38                 24
969                38                111
970                38                160
971                38                176
972                38                223
973                38                241
974                38                274
975                38                335
976                38                338
977                38                353
978                38                448
979                38                450
980                38                458
981                38                501
982                38                516
983                38                547
984                38                583
985                38                618
986                38                619
987                38                705
988                38                793
989                38                827
990                38                839
991                38                853
992                38                876
993                39                 71
994                39                 73
995                39                168
996                39                203
997                39                222
998                39                290
999                39                293

In [67]:
peliculas.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1000 entries, 0 to 1385
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Film_Id           1000 non-null   int64
 1   Title             1000 non-null   object
 2   Description       1000 non-null   object
 3   Release_Year      1000 non-null   int64
 4   Language          1000 non-null   object
 5   Rental_Duration   1000 non-null   int64
 6   Rental_Rate       1000 non-null   float64
 7   Length            1000 non-null   int64
 8   Replacement_Cost  1000 non-null   float64
 9   Rating            1000 non-null   object
 10  Special_Features  1000 non-null   object
 11  Genero            1000 non-null   object
dtypes: float64(2), int64(4), object(6)
memory usage: 101.6+ KB

In [68]:
actores.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Actor_Id     200 non-null    int64
 1   First_Name   200 non-null    object
 2   Last_Name    200 non-null    object
 3   Last_Update  200 non-null    datetime64[ns]
 4   Full_Name    200 non-null    object
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 7.9+ KB

In [ ]:
actores_peliculas.peliculas_Film_Id.info()

In [70]:
alquileres.columns

Index(['Rental_Date', 'Inventory_Id', 'Return_Date', 'Last_Update_x',
       'peliculas_Film_Id'],
      dtype='object')